---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternallyTaggedNonBReps
source: html/18f99fa5-638f-71f3-2ed7-a7ee6ca0f041.htm
---
# ExternallyTaggedNonBReps Methods

Adds a copy of the input ExternallyTaggedNonBRep to this collection.